frontend/models/SignupForm.php

    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->email = $this->email;
            $user->setPassword($this->password);
            $user->status = User::STATUS_WAIT;
            $user->generateAuthKey();
            $user->generateEmailConfirmToken();

            if ($user->save()){
---
INSERT INTO `user` (`email`, `password_hash`, `status`, `auth_key`, `email_confirm_token`, `created_at`, `updated_at`) VALUES ('a.mel@list.ru', '$2y$13$/xT6m2k./IfiLymv63/ure0Jr0ipO3uVC7XVGbya.vTll/vaX3/Sy', 2, 'Truyg7C4s9MU_IQ_-gHW1AEDTQjg8-kg', '4_OMdN6i3CroOpcWVBVeFEF0J8j7LvAI', 1558875783, 1558875783)